<a href="https://colab.research.google.com/github/TejaswiniKashireddy/B21_1425/blob/main/pandas_29/08/25%20.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
import pandas as pd
#create a series from list
data = [10,20,30,40,50]
series = pd.Series(data)
print("pandsa Series:")
print(series)

pandsa Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [1]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series = pd.Series(data,index=index_labels)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
import pandas as pd
data={ 'Name':['Alice','Bob','Charlie','David'],'Age':[25,30,35,40],'city':['New York','San Francisco','Los Angeles','Chicago']}
df=pd.DataFrame(data)
print(df)

      Name  Age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [11]:
#basic dataframe operations
#access a single column
print(df['Name'])
print(df[['Name','city']])
print(df.iloc[1])
print(df.iloc[2])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
      Name           city
0    Alice       New York
1      Bob  San Francisco
2  Charlie    Los Angeles
3    David        Chicago
Name              Bob
Age                30
city    San Francisco
Name: 1, dtype: object
Name        Charlie
Age              35
city    Los Angeles
Name: 2, dtype: object

In [12]:
df['Salary']=[50000,60000,70000,80000]
print(df)

      Name  Age           city  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000
3    David   40        Chicago   80000

In [14]:
df=df.drop('city',axis=1)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

In [15]:
#filtering Data
print(df[df['Age']>30])

      Name  Age  Salary
2  Charlie   35   70000
3    David   40   80000

In [16]:
#basic stastistics
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [24]:
#5.Real-world exmaple:student data
import pandas as pd
#creating a daa frame with student details
student_data={'Student_ID':[101,102,103,104],
'Name':['Alice','Bob','Charlie','David'],
'Marks':[85,92,78,95],
'Department':['Computer Science','Mathematics','Computer Science', 'Physics']}
df=pd.DataFrame(student_data)
print("student_data:")
print(df)

student_data:
   Student_ID     Name  Marks        Department
0         101    Alice     85  Computer Science
1         102      Bob     92       Mathematics
2         103  Charlie     78  Computer Science
3         104    David     95           Physics

In [25]:
#find student with marks>80
print("\nAverage Marks>80:")
print(df[df['Marks']>80])

Average Marks>80:
   Student_ID   Name  Marks        Department
0         101  Alice     85  Computer Science
1         102    Bob     92       Mathematics
3         104  David     95           Physics

In [26]:
#average marks
print("\nAverage Marks:")
print(df['Marks'].mean())

Average Marks:
87.5

In [27]:
#add a new column
df['Result']=['Pass' if x>=40 else 'Fail' for x in df['Marks']]
print("\nwith Result Column")
print(df)

with Result Column
   Student_ID     Name  Marks        Department Result
0         101    Alice     85  Computer Science   Pass
1         102      Bob     92       Mathematics   Pass
2         103  Charlie     78  Computer Science   Pass
3         104    David     95           Physics   Pass

In [30]:
stu_data={
    'stu_name':['Teju','Akshaya','Deekshith','Akash','sharan'],
    'stu_rollno':[1,2,3,4,5],
    'M1':[90,82,92,95,91],
    'M2':[92,81,92,96,95],
    'M3':[93,85,95,92,97],
}

df = pd.DataFrame(stu_data)

total=df['M1']+df['M2']+df['M3']
df['total']=total

result=['pass' if total>=270 else 'fail' for total in df['total']]
df['result']=result

avg=df['total']/3
df['average']=avg

print(df)

    stu_name  stu_rollno  M1  M2  M3  total result    average
0       Teju           1  90  92  93    275   pass  91.666667
1    Akshaya           2  82  81  85    248   fail  82.666667
2  Deekshith           3  92  92  95    279   pass  93.000000
3      Akash           4  95  96  92    283   pass  94.333333
4     sharan           5  91  95  97    283   pass  94.333333